In [1]:
import numpy as np
from datascience import *

# Examples with Properties

Properties look like variables but they automatically get their value from the object.

In [2]:
heights = Table().read_table("heights.csv")
heights

Name                         | Height
Colebank, Jordan Elise       | 65
Collins, Matthew T           | 72
Cook, Kylie Nichole          | 68
Downard, Andrew Nicholas     | nan
Duerinck, Randy Keith        | 67
Graham, Cassandra Michelle   | nan
Hodge, Devin Jonathan Monroe | 74
Hoover, David R              | 74.5
Linden, Andrew Ryan          | 69
Lynn, Matthew Michael        | 75
... (3 rows omitted)

In [3]:
heights.num_columns

2

In [4]:
heights.num_rows

13

In [5]:
heights.labels

('Name', 'Height')

In [6]:
heights.relabeled("Height", "Height in Inches")

Name                         | Height in Inches
Colebank, Jordan Elise       | 65
Collins, Matthew T           | 72
Cook, Kylie Nichole          | 68
Downard, Andrew Nicholas     | nan
Duerinck, Randy Keith        | 67
Graham, Cassandra Michelle   | nan
Hodge, Devin Jonathan Monroe | 74
Hoover, David R              | 74.5
Linden, Andrew Ryan          | 69
Lynn, Matthew Michael        | 75
... (3 rows omitted)

In [8]:
heights.column("Name")

array(['Colebank, Jordan Elise', 'Collins, Matthew T',
       'Cook, Kylie Nichole', 'Downard, Andrew Nicholas',
       'Duerinck, Randy Keith', 'Graham, Cassandra Michelle',
       'Hodge, Devin Jonathan Monroe', 'Hoover, David R',
       'Linden, Andrew Ryan', 'Lynn, Matthew Michael',
       'Martinez, Carli Sabrina', 'Verrando, Fabienne Esther',
       'Palmer, James'], dtype='<U28')

In [10]:
heights.column(1)

array([65. , 72. , 68. ,  nan, 67. ,  nan, 74. , 74.5, 69. , 75. , 65. ,
        nan, 71. ])

In [15]:
new_heights = heights.with_column("Student ID", np.arange(2000001,2000014)).with_column("Favorite Temperature", make_array(34, 56, 75, 57, 98, 22, 11, 7, 85, 12, 45, 33, 22))
new_heights

Name                         | Height | Student ID | Favorite Temperature
Colebank, Jordan Elise       | 65     | 2000001    | 34
Collins, Matthew T           | 72     | 2000002    | 56
Cook, Kylie Nichole          | 68     | 2000003    | 75
Downard, Andrew Nicholas     | nan    | 2000004    | 57
Duerinck, Randy Keith        | 67     | 2000005    | 98
Graham, Cassandra Michelle   | nan    | 2000006    | 22
Hodge, Devin Jonathan Monroe | 74     | 2000007    | 11
Hoover, David R              | 74.5   | 2000008    | 7
Linden, Andrew Ryan          | 69     | 2000009    | 85
Lynn, Matthew Michael        | 75     | 2000010    | 12
... (3 rows omitted)

In [16]:
new_heights.select("Name", "Student ID", "Favorite Temperature")

Name                         | Student ID | Favorite Temperature
Colebank, Jordan Elise       | 2000001    | 34
Collins, Matthew T           | 2000002    | 56
Cook, Kylie Nichole          | 2000003    | 75
Downard, Andrew Nicholas     | 2000004    | 57
Duerinck, Randy Keith        | 2000005    | 98
Graham, Cassandra Michelle   | 2000006    | 22
Hodge, Devin Jonathan Monroe | 2000007    | 11
Hoover, David R              | 2000008    | 7
Linden, Andrew Ryan          | 2000009    | 85
Lynn, Matthew Michael        | 2000010    | 12
... (3 rows omitted)

In [18]:
new_heights.drop("Height", "Student ID")

Name                         | Favorite Temperature
Colebank, Jordan Elise       | 34
Collins, Matthew T           | 56
Cook, Kylie Nichole          | 75
Downard, Andrew Nicholas     | 57
Duerinck, Randy Keith        | 98
Graham, Cassandra Michelle   | 22
Hodge, Devin Jonathan Monroe | 11
Hoover, David R              | 7
Linden, Andrew Ryan          | 85
Lynn, Matthew Michael        | 12
... (3 rows omitted)

In [19]:
heights

Name                         | Height
Colebank, Jordan Elise       | 65
Collins, Matthew T           | 72
Cook, Kylie Nichole          | 68
Downard, Andrew Nicholas     | nan
Duerinck, Randy Keith        | 67
Graham, Cassandra Michelle   | nan
Hodge, Devin Jonathan Monroe | 74
Hoover, David R              | 74.5
Linden, Andrew Ryan          | 69
Lynn, Matthew Michael        | 75
... (3 rows omitted)

In [20]:
new_heights

Name                         | Height | Student ID | Favorite Temperature
Colebank, Jordan Elise       | 65     | 2000001    | 34
Collins, Matthew T           | 72     | 2000002    | 56
Cook, Kylie Nichole          | 68     | 2000003    | 75
Downard, Andrew Nicholas     | nan    | 2000004    | 57
Duerinck, Randy Keith        | 67     | 2000005    | 98
Graham, Cassandra Michelle   | nan    | 2000006    | 22
Hodge, Devin Jonathan Monroe | 74     | 2000007    | 11
Hoover, David R              | 74.5   | 2000008    | 7
Linden, Andrew Ryan          | 69     | 2000009    | 85
Lynn, Matthew Michael        | 75     | 2000010    | 12
... (3 rows omitted)

In [28]:
salaries = Table().read_table("07_federalpay_top_100.csv")

In [29]:
salaries.sort("Pay", descending=True).show(5)

In [32]:
salaries.show(max_rows=1)

In [37]:
salaries.take(np.arange(10,100,10))

Name              | Organization                  | Occupation      | Pay    | Location
CITRIN DEBORAH E  | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 317000 | MARYLAND
GALLIN JOHN I     | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 348723 | MARYLAND
GREEN ERIC D      | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 303864 | MARYLAND
JONES ELIZABETH C | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 306250 | MARYLAND
LEE JANICE S      | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 291614 | MARYLAND
MEDINA EDWARD R   | INDIAN HEALTH SERVICE         | MEDICAL OFFICER | 327075 | ARIZONA
PINTO PETER A     | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 315000 | MARYLAND
SCHNORR CHARLES D | INDIAN HEALTH SERVICE         | MEDICAL OFFICER | 290000 | NEW MEXICO
TABAK LAWRENCE A  | NATIONAL INSTITUTES OF HEALTH | DENTAL OFFICER  | 337925 | MARYLAND

In [39]:
salaries.where("Pay", are.above(300000)).num_rows

64

In [43]:
salaries.sort("Pay", descending=True).where("Occupation", are.equal_to("MEDICAL OFFICER")).where("Location", are.equal_to("ARIZONA")).show(15)

In [45]:
salaries.where("Pay", are.between(295000, 300000))

Name                  | Organization                  | Occupation      | Pay    | Location
AUSTIN CHRISTOPHER P  | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 299320 | MARYLAND
BOWERS STEPHEN M      | INDIAN HEALTH SERVICE         | MEDICAL OFFICER | 296332 | ARIZONA
DURAN ANTONIO T.      | INDIAN HEALTH SERVICE         | MEDICAL OFFICER | 298413 | ARIZONA
GERBSTADT CHRISTINE R | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 295000 | MARYLAND
LAWRENCE LEE J        | INDIAN HEALTH SERVICE         | MEDICAL OFFICER | 295000 | SOUTH DAKOTA
MALAYERI ASHKAN       | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 296406 | MARYLAND
MIAO NING             | NATIONAL INSTITUTES OF HEALTH | MEDICAL OFFICER | 295000 | MARYLAND
PABLO DANIEL L        | INDIAN HEALTH SERVICE         | MEDICAL OFFICER | 296332 | OKLAHOMA

In [46]:
census = Table().read_table("http://www2.census.gov/programs-surveys/popest/datasets/2010-2015/national/asrh/nc-est2015-agesex-res.csv")

In [51]:
census_2010_2014 = census.select("SEX", "AGE", "POPESTIMATE2010", "POPESTIMATE2014").relabeled("SEX", "GENDER").relabeled("POPESTIMATE2010", "2010").relabeled("POPESTIMATE2014", "2014")

In [54]:
census_no_gender = census_2010_2014.where("GENDER", are.equal_to(0)).drop("GENDER")
census_no_gender

AGE  | 2010    | 2014
0    | 3951330 | 3949775
1    | 3957888 | 3949776
2    | 4090862 | 3959664
3    | 4111920 | 4007079
4    | 4077551 | 4005716
5    | 4064653 | 4006900
6    | 4073013 | 4135930
7    | 4043046 | 4155326
8    | 4025604 | 4120903
9    | 4125415 | 4108349
... (92 rows omitted)

In [56]:
census_with_difference = census_no_gender.with_column("Difference", census_no_gender.column("2014") - census_no_gender.column("2010"))

In [59]:
census_final = census_with_difference.with_column("% difference", 100.0 * census_with_difference.column("Difference") / census_with_difference.column("2010"))

In [60]:
census_final.sort("AGE", descending=True)

AGE  | 2010      | 2014      | Difference | % difference
999  | 309346863 | 318907401 | 9560538    | 3.09056
100  | 54410     | 71626     | 17216      | 31.6412
99   | 32178     | 41468     | 9290       | 28.8707
98   | 47037     | 59726     | 12689      | 26.9766
97   | 68893     | 83089     | 14196      | 20.6059
96   | 97161     | 120485    | 23324      | 24.0055
95   | 131077    | 156288    | 25211      | 19.2337
94   | 170775    | 217328    | 46553      | 27.2598
93   | 219064    | 284885    | 65821      | 30.0465
92   | 288841    | 352912    | 64071      | 22.1821
... (92 rows omitted)